{
  "entries": [
    {
      "id": 1,
      "date": "1/14/21",
      "concept": "JS Data Debugging",
      "entry": "We talked about using the console to debug code in our JS data handling",
      "mood": "Fine"
    },
    {
      "id": 2,
      "date": "1/13/21",
      "concept": "JS Data",
      "entry": "We used js functions to dynamically populate our HTML files. It took a lot to understand the different variables and what they were representing, especially within the scope of their functions and the global scope with import and export statements separating the modules",
      "mood": "Frusturated"
    },
    {
      "id": 3,
      "date": "1/12/21",
      "concept": "Flexbox",
      "entry": "We learned about flexbox styling and I thought handling flex boxes within flexboxes would be simple. It was not.",
      "mood": "Overwhelmed"
    },
    {
      "id": 4,
      "date": "1/11/21",
      "concept": "Wireframing",
      "entry": "We talked about how wireframing your site layout saves time with HTML scturcture hard coding. We got a real life example of this in my team's planning stage where wireframing made hard-coding a breeze",
      "mood": "Proud"
    },
    {
      "date": "",
      "concept": "",
      "entry": "",
      "mood": "Fine",
      "id": 5
    },
    {
      "date": "2021-02-01",
      "concept": "Debugging",
      "entry": "Let's try the button again",
      "mood": "Fine",
      "id": 6
    },
    {
      "date": "",
      "concept": "saving entries",
      "entry": "testing concepts",
      "mood": "Fine",
      "id": 7
    },
    {
      "date": "2021-02-01",
      "concept": "Debugging",
      "entry": "Learned about the \"debugger\" tool and how helpful it can be.\n\nThe way to use it is to insert it into bode blocks that to see if they are executing they way you expect them too. You also use it to see the values of the data they are running. \n\nI was able to use it to figure out why my entries weren't rendering to the DOM. The reason is that I had a typo in my input fields where I spelled the id of journal as \"jorunal\" so no data was coming through.\n\nI also had my useJournalEntries function returning undefined because I had written one of my .then functions incorrectly The logic was sound by the syntax was broken.",
      "mood": "Fine",
      "id": 8
    }
  ]
}